### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.function_app.azurerm_storage_blob.featured_services must be replaced
-/+ resource "azurerm_storage_blob" "featured_services" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "3d5f3ed14d1bcc77a20a99106f4957f4" -> "b725527983ebc3b9ddec2f6b23c7dcd1" # forces replacement
      ~ id                     = "https://iopitnsvcappbest01.blob.core.windows.net/static-content/featured-services.json" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "featured-services.json"
      ~ url                    = "https://iopitnsvcappbest01.blob.core.windows.net/static-content/featured-services.json" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.container_apps.module.backend_func_itn.azapi_resource.this[0] will be updated in-place
  ~ resource "azapi_resource" "this" {
      ~ body                      = {
          ~ properties = {
              ~ template      = {
                  ~ containers                    = [
                      ~ {
                            name      = "appbackend"
                          ~ probes    = [
                              ~ {
                                  ~ failureThreshold    = 3 -> 10
                                  ~ tcpSocket           = {
                                      - port = 80
                                    } -> null
                                    # (4 unchanged attributes hidden)
                                },
                              ~ {
                                  ~ failureThreshold    = 10 -> 3
                                  ~ httpGet             = {
                                      - httpHeaders = null
                                      - path        = "/api/v1/info"
                                      - port        = 80
                                      - scheme      = "HTTP"
                                    } -> null
                                    # (3 unchanged attributes hidden)
                                },
                            ]
                            # (3 unchanged attributes hidden)
                        },
                    ]
                  ~ scale                         = {
                      ~ minReplicas     = 50 -> 40
                      ~ rules           = [
                          ~ {
                              ~ http = {
                                  ~ metadata = {
                                      ~ concurrentRequests = "40" -> "50"
                                    }
                                }
                                name = "http-scale-rule"
                            },
                            {
                                custom = {
                                    auth     = null
                                    metadata = {
                                        type  = "Utilization"
                                        value = "70"
                                    }
                                    type     = "cpu"
                                }
                                name   = "cpu-scale-rule"
                            },
                            # (1 unchanged element hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    }
                    # (1 unchanged attribute hidden)
                }
                # (2 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.App/containerApps/io-p-itn-svc-app-be-func-02"
        name                      = "io-p-itn-svc-app-be-func-02"
      ~ output                    = {
          - properties = {
              - configuration = {
                  - ingress = {
                      - fqdn = "io-p-itn-svc-app-be-func-02.ambitioussea-e5d71305.italynorth.azurecontainerapps.io"
                    }
                }
            }
        } -> (known after apply)
        tags                      = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/cms_function_app.cms_storage_account/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and 7 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-review"],
  on .terraform/modules/cms_function_app.cms_storage_account/storage_account.tf line 139, in resource "azurerm_storage_queue" "this":
 139:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 27 more similar warnings elsewhere)
```

</details>
